作業目標:<br>
1. 熟悉分組計算

作業重點: <br>
1. 分組計算也可以加入apply自定義的函數

題目 : 運用下列分數資料分析<br>
1. 找出全年級各科成績最高分與最低分?<br>
2. 找出數學班平均最高的班級?<br>
3. 分析全校女生與男生國文平均差幾分?<br>
score_df = pd.DataFrame([[1,50,80,70,'boy',1],[2,60,45,50,'boy',2],[3,98,43,55,'boy',1],[4,70,69,89,'boy',2],[5,56,79,60,'girl',1],[6,60,68,55,'girl',2],[7,45,70,77,'girl',1],[8,55,77,76,'girl',2],[9,25,57,60,'girl',1],[10,88,40,43,'girl',3],[11,25,60,45,'boy',3],[12,80,60,23,'boy',3],[13,20,90,66,'girl',3],[14,50,50,50,'girl',3],[15,89,67,77,'girl',3]],columns=['student_id','math_score','english_score','chinese_score','sex','class'])

In [1]:
import pandas as pd
score_df = pd.DataFrame([[1,50,80,70,'boy',1], 
              [2,60,45,50,'boy',2],
              [3,98,43,55,'boy',1],
              [4,70,69,89,'boy',2],
              [5,56,79,60,'girl',1],
              [6,60,68,55,'girl',2],
              [7,45,70,77,'girl',1],
              [8,55,77,76,'girl',2],
              [9,25,57,60,'girl',1],
              [10,88,40,43,'girl',3],
              [11,25,60,45,'boy',3],
              [12,80,60,23,'boy',3],
              [13,20,90,66,'girl',3],
              [14,50,50,50,'girl',3],
              [15,89,67,77,'girl',3]],columns=['student_id','math_score','english_score','chinese_score','sex','class'])
score_df.head()

   student_id  math_score  english_score  chinese_score   sex  class
0           1          50             80             70   boy      1
1           2          60             45             50   boy      2
2           3          98             43             55   boy      1
3           4          70             69             89   boy      2
4           5          56             79             60  girl      1

In [2]:
score_df = score_df.set_index('student_id')

In [3]:
#1.找出全年級各科成績最高分與最低分?
print(score_df[['math_score','english_score','chinese_score']].max())
print(score_df[['math_score','english_score','chinese_score']].min())
score_df[['math_score','english_score','chinese_score']].agg(['max','min'])

math_score       98
english_score    90
chinese_score    89
dtype: int64
math_score       20
english_score    40
chinese_score    23
dtype: int64

     math_score  english_score  chinese_score
max          98             90             89
min          20             40             23

In [4]:
#2.找出數學班平均最高的班級?
score_df[['class','math_score']].groupby('class').mean()
# class = 2

       math_score
class
1       54.800000
2       61.250000
3       58.666667

In [5]:
#3.分析全校女生與男生國文平均差幾分?
abs(score_df.loc[score_df.sex=='boy']['chinese_score'].mean()-\
    score_df.loc[score_df.sex=='girl']['chinese_score'].mean())

7.333333333333329

In [6]:
score_df[['sex','chinese_score']].groupby(['sex']).mean()

      chinese_score
sex
boy       55.333333
girl      62.666667